# =============================================================================
# Taps - External repositories
# =============================================================================
tap "go-task/tap"

# =============================================================================
# CLI Tools - General development utilities
# =============================================================================
brew "fzf"          # Command-line fuzzy finder
brew "gh"           # GitHub CLI
brew "git"          # Version control system
brew "neovim"       # Text editor
brew "starship"     # Cross-shell prompt
brew "tmux"         # Terminal multiplexer
brew "eza"          # Modern replacement for ls

# =============================================================================
# Shell Enhancements
# =============================================================================
brew "zsh-autosuggestions"  # Fish-like autosuggestions for zsh

# =============================================================================
# Programming Language Support
# =============================================================================
brew "pyenv"        # Python version management

# =============================================================================
# Mobile Development
# =============================================================================
brew "cocoapods"    # Dependency manager for Swift and Objective-C
brew "fastlane"     # App automation tool
brew "watchman"     # File watching service

# =============================================================================
# Task Runners
# =============================================================================
brew "go-task/tap/go-task"  # Task runner / simpler Make alternative

# =============================================================================
# Applications (Casks)
# =============================================================================
cask "ghostty"              # Terminal emulator
cask "orbstack"             # Docker and Linux VM alternative
cask "visual-studio-code"   # Code editor
cask "zulu@17"              # Java Development Kit
